

obj = {
  soccer_ball: 410,
  tennis_ball: 58,
  golf_ball: 45}

#Задание: “лунный магазин”. Используя хеш с новым весом из предыдущего задания
#напишите программу, которая для каждого типа спрашивает пользователя какое
#количество мячей пользователь хотел бы купить в магазине (ввод числа из консоли). В
#конце программа выдает общий вес всех товаров в корзине. Для сравнения программа
#должна также выдавать общий вес всех товаров, если бы они находились на Земле.

puts "Добро пожаловать астронафт, в нашем лунном магазине"
puts "У нас в Наличе есть мячи: Для Футбола(1), Гольфа(2) и Тениса(3)"

puts "Какой вы мячь выбрали"

user_input = gets.downcase.to_i

while user_input == nil || user_input >= 4
  puts  "Введите 1 для Футбольного, 2 для мяча Гольфа, 3 для тенисного мяча"
  user_input = gets.downcase.to_i
end

puts "Введите кол-во мячей "

count = gets.to_i

if user_input == 1
 soccer =  count * (obj[:soccer_ball] / 6)
puts "Ваши мячи будут весить на луне: " + soccer.to_s
elsif user_input == 2
  golf =  count * (obj[:golf_ball] / 6)
  puts "Ваши мячи будут весить на луне: " + golf.to_s
else
  tenis =  count * (obj[:tennis_ball] / 6)
  puts "Ваши мячи будут весить на луне: " + tenis.to_s
end
