#Объявите в программе пустой массив. Спросите у пользователя какой длины должен быть массив.

#Запомните выбор пользователя и наполните массив нужным количеством случайных чисел. Числа должны быть в диапазоне от 0 до 100 (вспомните метод rand из прошлых задач). Выведите получившийся массив на экран.

#После вывода массива найдите в нем максимальный по величине элемент и выведите на экран его значение.


array = []

puts "Какой длинной будет массив"

start = 0
user_input = gets.to_i
puts "Длинна массива : #{user_input}"

while start < user_input do

  array << rand(100)
  start +=1
end
puts  array.to_s

max_value = 0
for item in array do
  if item > max_value
    max_value = item
  end
end

puts "Самое большое число: #{max_value}"
